index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-13 Tue 13:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>WGSL Bug</title>
<meta name="author" content="Kabir Kwatra" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">WGSL Bug</h1>

<div id="outline-container-org7f2d42c" class="outline-2">
<h2 id="org7f2d42c"><a href="./wgslbug.wgsl">Code</a></h2>
<div class="outline-text-2" id="text-org7f2d42c">
<div class="org-src-container">
<pre class="src src-wgsl"><span class="linenr"> 1: </span>@group<span style="color: #61bfff;">(</span><span style="color: #bd93f9; font-weight: bold;">0</span><span style="color: #61bfff;">)</span>
<span class="linenr"> 2: </span>@binding<span style="color: #61bfff;">(</span><span style="color: #bd93f9; font-weight: bold;">0</span><span style="color: #61bfff;">)</span>
<span class="linenr"> 3: </span><span style="color: #ff79c6;">var</span><span style="color: #61bfff;">&lt;</span><span style="color: #8be9fd;">storage</span>, <span style="color: #8be9fd;">read_write</span><span style="color: #61bfff;">&gt;</span> <span style="color: #ffc9e8;">flow</span>: <span style="color: #bd93f9;">array</span><span style="color: #61bfff;">&lt;</span><span style="color: #bd93f9;">u32</span>, <span style="color: #bd93f9; font-weight: bold;">2</span><span style="color: #61bfff;">&gt;</span>;
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>@<span style="color: #8be9fd;">compute</span>
<span class="linenr"> 6: </span>@<span style="color: #ffb86c;">workgroup_size</span><span style="color: #61bfff;">(</span><span style="color: #bd93f9; font-weight: bold;">1</span><span style="color: #61bfff;">)</span>
<span class="linenr"> 7: </span><span style="color: #ff79c6;">fn</span> <span style="color: #50fa7b;">main</span><span style="color: #61bfff;">()</span> <span style="color: #61bfff;">{</span>
<span class="linenr"> 8: </span>    <span style="color: #ff79c6;">var</span> <span style="color: #ffc9e8;">LOOP_COUNTER</span>: <span style="color: #bd93f9;">u32</span> = <span style="color: #bd93f9; font-weight: bold;">0u</span>;
<span class="linenr"> 9: </span>    <span style="color: #ff79c6;">loop</span> <span style="color: #ff79c6;">{</span>
<span class="linenr">10: </span>        <span style="color: #50fa7b;">(</span>flow<span style="color: #50fa7b;">)[</span><span style="color: #bd93f9; font-weight: bold;">0u</span><span style="color: #50fa7b;">]</span> += <span style="color: #8be9fd;">1</span><span style="color: #ff79c6;">u</span>;
<span class="linenr">11: </span>        <span style="color: #ff79c6;">if</span> <span style="color: #50fa7b;">(</span>LOOP_COUNTER &gt;= <span style="color: #8be9fd;">1</span><span style="color: #ff79c6;">u</span><span style="color: #50fa7b;">)</span> <span style="color: #50fa7b;">{</span>
<span class="linenr">12: </span>            <span style="color: #bd93f9;">(</span>flow<span style="color: #bd93f9;">)[</span><span style="color: #8be9fd;">1</span><span style="color: #ff79c6;">u</span><span style="color: #bd93f9;">]</span> += <span style="color: #8be9fd;">1</span><span style="color: #ff79c6;">u</span>;
<span class="linenr">13: </span>            <span style="color: #ff79c6;">break</span>;
<span class="linenr">14: </span>        <span style="color: #50fa7b;">}</span>
<span class="linenr">15: </span>        LOOP_COUNTER += <span style="color: #8be9fd;">1</span><span style="color: #ff79c6;">u</span>;
<span class="linenr">16: </span>    <span style="color: #ff79c6;">}</span>
<span class="linenr">17: </span><span style="color: #61bfff;">}</span>
</pre>
</div>

<p>
Expected output is <code>[2, 1]</code> after executing break statement in second iteration of loop.
</p>
</div>
</div>

<div id="outline-container-orgb6817f7" class="outline-2">
<h2 id="orgb6817f7">Results</h2>
<div class="outline-text-2" id="text-orgb6817f7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Vendor</th>
<th scope="col" class="org-left">GPU</th>
<th scope="col" class="org-left">Dawn Vulkan Linux</th>
<th scope="col" class="org-left">wGPU Vulkan Linux</th>
<th scope="col" class="org-left">Dawn Vulkan Windows</th>
<th scope="col" class="org-left">wGPU Vulkan Windows</th>
<th scope="col" class="org-left">Dawn DX12 Windows</th>
<th scope="col" class="org-left">wGPU DX12 Windows</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Nvidia</td>
<td class="org-left">RTX 2060 Max-Q</td>
<td class="org-left">Timeout</td>
<td class="org-left">ND<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup></td>
<td class="org-left">Zeros<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup></td>
<td class="org-left">Zeros<sup><a id="fnr.2.100" class="footref" href="#fn.2" role="doc-backlink">2</a></sup></td>
<td class="org-left">Correct</td>
<td class="org-left">Correct</td>
</tr>

<tr>
<td class="org-left">Nvidia</td>
<td class="org-left">RTX 2060 Super</td>
<td class="org-left">Timeout</td>
<td class="org-left">ND<sup><a id="fnr.1.100" class="footref" href="#fn.1" role="doc-backlink">1</a></sup></td>
<td class="org-left">Zeros<sup><a id="fnr.2.100" class="footref" href="#fn.2" role="doc-backlink">2</a></sup></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Correct</td>
<td class="org-left">Correct</td>
</tr>

<tr>
<td class="org-left">Nvidia</td>
<td class="org-left">GTX 1050 Ti</td>
<td class="org-left">Timeout</td>
<td class="org-left">Correct</td>
<td class="org-left">Zeros<sup><a id="fnr.2.100" class="footref" href="#fn.2" role="doc-backlink">2</a></sup></td>
<td class="org-left">Correct</td>
<td class="org-left">Correct</td>
<td class="org-left">Correct</td>
</tr>

<tr>
<td class="org-left">Nvidia</td>
<td class="org-left">Quadro 4000</td>
<td class="org-left">Correct</td>
<td class="org-left">Correct</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">AMD</td>
<td class="org-left">Ryzen 9 4900HS (iGPU)</td>
<td class="org-left">Correct</td>
<td class="org-left">Correct</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Intel</td>
<td class="org-left">i7-9700K (iGPU)</td>
<td class="org-left">Correct</td>
<td class="org-left">Inconsistent<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Intel</td>
<td class="org-left">i5-7400 (iGPU)</td>
<td class="org-left">Correct</td>
<td class="org-left">Correct</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Non Deterministic results where the first element is large and the second element is zero; produces correct result if either of the flow increments are removed.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Output is <code>[0, 0]</code>, presumed to be as a result of a timeout.
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Sometimes produces correct output, other times produces <code>[0, 0]</code> without timing out.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Kabir Kwatra</p>
<p class="date">Created: 2022-09-13 Tue 13:15</p>
</div>
</body>
</html>
